routes/web.php

select * from `authors`
select `authors`.`name`, `books`.`title`, `reviews`.`rating` from `authors` inner join `books` on `authors`.`id` = `books`.`author_id` inner join `reviews` on `books`.`id` = `reviews`.`book_id`
select * from `authors` where exists (select * from `books` where `authors`.`id` = `books`.`author_id` and `pages` > 500)
select author_id, AVG(pages) as average_pages from `books` group by `author_id` having `average_pages` > 300
select `authors`.*, (select count(*) from `books` where `authors`.`id` = `books`.`author_id`) as `books_count` from `authors` order by `books_count` desc
select * from `books` where `title` like '%adventure%'
select * from `books` where `pages` > 200 and `created_at` > '2024-03-17 14:36:51' and exists (select * from `reviews` where `books`.`id` = `reviews`.`book_id` and `rating` > 4)
---

Route::get('/test-queries', function () {
    // 1. Простой запрос (быстрый)
    $simpleQuery = Author::all();

    // 2. Запрос с отношениями (может быть медленнее)
    $eagerLoading = Author::with('books')->get();

    // 3. Сложный запрос с несколькими объединениями (может быть медленным)
    $complexJoin = DB::table('authors')
        ->join('books', 'authors.id', '=', 'books.author_id')
        ->join('reviews', 'books.id', '=', 'reviews.book_id')
        ->select('authors.name', 'books.title', 'reviews.rating')
        ->get();

    // 4. Запрос с подзапросом (потенциально медленный)
    $subQuery = Author::whereHas('books', function ($query) {
        $query->where('pages', '>', 500);
    })->get();

    // 5. Запрос с агрегацией (может быть медленным на больших объемах данных)
    $aggregation = Book::groupBy('author_id')
        ->selectRaw('author_id, AVG(pages) as average_pages')
        ->having('average_pages', '>', 300)
        ->get();

    // 6. Запрос с сортировкой по связанной таблице (может быть очень медленным)
    $sortByRelation = Author::withCount('books')
        ->orderBy('books_count', 'desc')
        ->get();

    // 7. Запрос с использованием like (может быть медленным без индекса)
    $likeQuery = Book::where('title', 'like', '%adventure%')->get();

    // 8. Запрос с множественными условиями (может быть медленным)
    $multiCondition = Book::where('pages', '>', 200)
        ->where('created_at', '>', now()->subMonths(6))
        ->whereHas('reviews', function ($query) {
            $query->where('rating', '>', 4);
        })
        ->get();

(select * from `books` where `pages` < 100) union (select * from `books` where `pages` > 500)
---
    $rawSql = DB::select(DB::raw('SELECT * FROM books WHERE pages > 500'));

    // 10. Запрос с использованием union (может быть медленным)
    $union = Book::where('pages', '<', 100)
        ->union(Book::where('pages', '>', 500))
        ->get();

select distinct `book_id` from `reviews`
select `author_id` from `books` group by `author_id` having COUNT(*) > 5
---
    $largeWhereIn = Book::whereIn('id', range(1, 1000))->get();

    // 12. Запрос с использованием distinct (может быть медленным на больших таблицах)
    $distinct = Review::select('book_id')->distinct()->get();

    // 13. Запрос с использованием having без group by (может быть медленным)
    $havingWithoutGroup = Book::select('author_id')
        ->having(DB::raw('COUNT(*)'), '>', 5)
        ->get();

select * from `books` where LOWER(title) = 'some title'
select `books`.`author_id`, AVG(reviews.rating) as avg_rating, COUNT(DISTINCT books.id) as book_count from `books` inner join `reviews` on `books`.`id` = `reviews`.`book_id` group by `books`.`author_id` having AVG(reviews.rating) > 4 order by `avg_rating` desc
select `authors`.`name`, `books`.`title` from `authors` cross join `books` limit 100
select `title`, `pages`, AVG(pages) OVER (PARTITION BY author_id) as avg_pages_by_author from `books` order by `author_id` asc
---
    $functionInWhere = Book::whereRaw('LOWER(title) = ?', [strtolower('Some Title')])->get();

    // 16. Запрос с использованием full text search (может быть быстрым с правильным индексом, медленным без него)
    $fullTextSearch = Book::whereRaw('MATCH(title, description) AGAINST(? IN BOOLEAN MODE)', ['adventure'])->get();

    // 17. Запрос с использованием сложной агрегации (может быть очень медленным)
    $complexAggregation = DB::table('books')
        ->join('reviews', 'books.id', '=', 'reviews.book_id')
        ->select('books.author_id', DB::raw('AVG(reviews.rating) as avg_rating, COUNT(DISTINCT books.id) as book_count'))
        ->groupBy('books.author_id')
        ->havingRaw('AVG(reviews.rating) > ?', [4])
        ->orderBy('avg_rating', 'desc')
        ->get();

    // 18. Запрос с использованием cross join (может быть очень медленным на больших таблицах)
    $crossJoin = DB::table('authors')
        ->crossJoin('books')
        ->select('authors.name', 'books.title')
        ->limit(100)
        ->get();

    // 19. Запрос с использованием оконных функций (может быть медленным)
    $windowFunction = DB::table('books')
        ->select('title', 'pages',
            DB::raw('AVG(pages) OVER (PARTITION BY author_id) as avg_pages_by_author')
        )
        ->orderBy('author_id')
        ->get();